OpenFOAM/simpleFsi-OF3.0.0/cases/main-les-long/system/simpleFsi
simpleFsi1
{
    type        simpleFsi;
    
    functionObjectLibs ( "libsimpleFsiFunctionObject.so" );
        
    outputControl   timeStep;
    timeInterval    1;
    
    log         yes;
    
    patches     ( cylinder );
    rhoName     rhoInf;      // Indicates incompressible
    rhoInf      1000;           // Redundant for incompressible
    CofR        (0 0 0);  // 
    
    //FSI
    M		22.832; //mass without water
    K		1297.97;
    C		6.86;
    R		282;
    results	"yD.csv";
    Ymax	1.0; //Unbounded
}

